public class setting {
	public static void main(String[] args) {
		System.out.println("문제 1번");
		/**
		 * 문제: 명령 프롬프트 창에서 javac -version을 입력하고 엔터치면 에러가 나는데 그 이유를 설명하시오.
		 * 이 문제는 자바 코드를 작성한 후 실행시 자주 접하는 에러 유형에 대해서 그 원인을 알고 있는지를 묻는 문제이다.
		 * 
		 * 답변: JAVA의 환경변수가 재대로 설정이 되어 있지 않아서 발생하는 문제라고 생각합니다.
		 * 환경변수를 재대로 설정해야 해당 플랫폼에서 동작할 수 있습니다.
		 */
		System.out.println("문제 2번");
		/**
		 * 문제: 자바 코드가 작성이 되어져서 최종 실행이 되는 과정을 설명하시오.
		 * 파이썬 언어와 비교해서 설명해보시오.
		 * 자바로 작성한 코드를 저장할 때 확장자는 어떻게 저장하는지 말해보시오. 파이썬은..???
		 * 이 문제는 자바 코드가 실행시 어떤 과정을 통해서 결과로 출력되는지를 알고 있는지 묻는 문제이다.
		 * 
		 * 답변: 자바 코드는 어떤 플랫폼에서도 돌아가도록 설계 되어서 JVM을 사용합니다.
		 * 먼저 JAVA Code를 컴파일러가 class 파일로 컴파일합니다.
		 * 그 다음 class 파일을 JVM이 각 플랫폼에 맞는 기계어로 변환하여, 실행합니다.
		 */
	}
}
