public class Java100_variable_HelloWorld4 {
	public static void main(String[] args) {
		/**
		 * 문제: 자바 메인 메서드에서 static 키워드의 역할에 대해서 설명해보시오. (★ ★ ★)
		 * 작성한 자바 코드를 실행시 static을 안쓰면 에러가 나는데 그 이유가 무엇인지도 같이 설명해보시오.
		 * 이 문제는 static의 개념과 역할에 대해서 알고 있는지를 묻는 문제이다.
		 * 
		 * 답변: static은 정적으로 메모리에 올려둔다는 뜻으로 main()의 특성상, 맨 처음 실행되어야 하기때문에 선언합니다.
		 * static으로 선언을 할 경우, 컴파일시에 메모리에 변수나 메서드를 올려두게 됩니다.
		 * 따라서 static으로 선언을 하지않게 되면 실행시 맨 처음 메모리상에 떠있는 main()을 찾지 못하게 되고,
		 * 결국 실행 실패를 하게됩니다. 따라서 static이라는 키워드를 반드시 사용해야 합니다.
		 */
	}
}
